Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
        Serial.println("\n========================================");
        Serial.println("     WIFI CONNECTION SUCCESSFUL");
        Serial.println("========================================");
        Serial.print("[WIFI] IP Address: ");
        Serial.println(WiFi.localIP());
        Serial.print("[WIFI] SSID: ");
        Serial.println(WiFi.SSID());
        Serial.print("[WIFI] Signal Strength: ");
        Serial.print(WiFi.RSSI());
        Serial.println(" dBm");
        Serial.print("[WIFI] MAC Address: ");
        Serial.println(WiFi.macAddress());
        Serial.print("[WIFI] Connection Time: ");
        Serial.print(connectDuration);
        Serial.println("ms");
        Serial.println("========================================\n");
        
        // Get custom parameters
        strncpy(customDeviceName, custom_device_name.getValue(), 40);
        saveCustomParameters();
        
        // Start mDNS service
        String hostname = String(customDeviceName);
        hostname.toLowerCase();
        hostname.replace(" ", "-");
        if (MDNS.begin(hostname.c_str())) {
            Serial.print("[MDNS] mDNS responder started: ");
            Serial.print(hostname);
            Serial.println(".local");
            MDNS.addService("http", "tcp", 80);
            Serial.println("[MDNS] HTTP service added");
        } else {
            Serial.println("[ERROR] mDNS failed to start");
        }
        
        // Solid LED to indicate connected (active LOW)
        digitalWrite(STATUS_LED_PIN, LOW);
    } else {
        // Failed to connect - fallback to AP mode
        Serial.println("[ERROR] Failed to connect - starting fallback AP mode");
        wifiConnected = false;
        initializeWiFi();
    }
}

void checkConfigPortalTrigger() {
    static bool warningShown = false;
    
    // Check if portal trigger button is pressed
    if (digitalRead(PORTAL_TRIGGER_PIN) == LOW) {
        if (portalButtonPressTime == 0) {
            portalButtonPressTime = millis();
            warningShown = false;
            Serial.println("[PORTAL] Config button pressed (hold for 3s to trigger)");
        } else {
            unsigned long holdDuration = millis() - portalButtonPressTime;
            
            // Warning at 2.5 seconds - only show once
            if (holdDuration > 2500 && !warningShown && !portalRunning) {
                Serial.println("[PORTAL] Warning: Portal trigger in 0.5s...");
                warningShown = true;
            }
            
            if (holdDuration > PORTAL_TRIGGER_DURATION && !portalRunning) {
                Serial.println("[PORTAL] Portal trigger detected! Resetting WiFi and restarting...");
                Serial.print("[PORTAL] Free heap before reset: ");
                Serial.print(ESP.getFreeHeap());
                Serial.println(" bytes");
                portalRunning = true;
                
                // Blink LED rapidly (active LOW)
                Serial.println("[PORTAL] Blinking status LED (confirmation)");
                for (int i = 0; i < 20; i++) {
                    digitalWrite(STATUS_LED_PIN, !digitalRead(STATUS_LED_PIN));
                    delay(50);
                }
                
                // Clear WiFi settings (ESP8266 stores WiFi creds in flash)
                Serial.println("[PORTAL] Disconnecting WiFi and clearing saved networks...");
                WiFi.disconnect(true); // true = also erase stored credentials
                delay(1000);
                
                // Restart to trigger portal
                Serial.println("[PORTAL] Restarting ESP8266 in 1s...");
                Serial.flush();
                delay(1000);
                ESP.restart();
            }
        }
    } else {
        if (portalButtonPressTime > 0) {
            unsigned long pressDuration = millis() - portalButtonPressTime;
            Serial.print("[PORTAL] Config button released after ");
            Serial.print(pressDuration);
            Serial.println("ms (trigger requires 3000ms)");
        }
        portalButtonPressTime = 0;
        portalRunning = false;
        warningShown = false;
    }
}

void saveCustomParameters() {
    Serial.println("[EEPROM] Saving custom parameters...");
    
    // Read current EEPROM data
    EEPROM.get(0, eepromData);
    
    // Update device name
    strncpy(eepromData.deviceName, customDeviceName, 39);
    eepromData.deviceName[39] = '\0';
    
    // Write back to EEPROM
    EEPROM.put(0, eepromData);
    EEPROM.commit();
    
    Serial.print("[EEPROM] Custom parameters saved: Device Name = '");
    Serial.print(customDeviceName);
    Serial.println("'");
}

void saveChasingGroups() {
    Serial.println("[EEPROM] Saving chasing groups...");
    
    // Read current EEPROM data
    EEPROM.get(0, eepromData);
    
    // Update chasing groups
    eepromData.chasingGroupCount = 0;
    for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
        if (chasingGroups[i].active) {
            eepromData.chasingGroups[i].groupId = chasingGroups[i].groupId;
            eepromData.chasingGroups[i].active = true;
            strncpy(eepromData.chasingGroups[i].name, chasingGroups[i].name, 20);
            eepromData.chasingGroups[i].name[20] = '\0';
            eepromData.chasingGroups[i].outputCount = chasingGroups[i].outputCount;
            eepromData.chasingGroups[i].interval = chasingGroups[i].interval;
            for (int j = 0; j < chasingGroups[i].outputCount; j++) {
                eepromData.chasingGroups[i].outputIndices[j] = chasingGroups[i].outputIndices[j];
            }
            eepromData.chasingGroupCount++;
        } else {
            eepromData.chasingGroups[i].active = false;
        }
    }
    
    // Write back to EEPROM
    EEPROM.put(0, eepromData);
    EEPROM.commit();
    
    Serial.print("[EEPROM] Saved ");
    Serial.print(eepromData.chasingGroupCount);
    Serial.println(" chasing groups");
}

void loadChasingGroups() {
    Serial.println("[EEPROM] Loading chasing groups...");
    
    // Read EEPROM data
    EEPROM.get(0, eepromData);
    
    int loadedGroups = 0;
    
    for (int i = 0; i < MAX_CHASING_GROUPS; i++) {
        if (eepromData.chasingGroups[i].active && eepromData.chasingGroups[i].outputCount > 0) {
            chasingGroups[i].groupId = eepromData.chasingGroups[i].groupId;
            chasingGroups[i].active = true;
            strncpy(chasingGroups[i].name, eepromData.chasingGroups[i].name, 20);
            chasingGroups[i].name[20] = '\0';
            chasingGroups[i].outputCount = eepromData.chasingGroups[i].outputCount;
            chasingGroups[i].interval = eepromData.chasingGroups[i].interval;
            chasingGroups[i].currentStep = 0;
            chasingGroups[i].lastStepTime = millis();
            
