Mark-Ortner-NRW/RailHub32-ESP32-Firmware/esp8266-controller/src/main.cpp
        // JavaScript chunk
        server->sendContent(F("<script>async function load(){try{const r=await fetch('/api/status');const d=await r.json();"
        "document.getElementById('heap').textContent=(d.freeHeap/1024).toFixed(1)+'KB';"
        "const s=Math.floor(d.uptime/1000);document.getElementById('uptime').textContent=s+'s';"
        "const sel=document.getElementById('outputSelector');"
        "const checked=[];document.querySelectorAll('#outputSelector input:checked').forEach(cb=>checked.push(cb.value));"
        "sel.innerHTML='';"
        "d.outputs.forEach(out=>{"
        "const lbl=document.createElement('label');lbl.style.display='block';lbl.style.marginBottom='5px';"
        "const cb=document.createElement('input');cb.type='checkbox';cb.value=out.pin;cb.id='out_'+out.pin;"
        "cb.disabled=out.chasingGroup>=0;if(checked.includes(out.pin.toString()))cb.checked=true;lbl.appendChild(cb);"
        "lbl.appendChild(document.createTextNode(' GPIO '+out.pin+(out.chasingGroup>=0?' [In Group '+out.chasingGroup+']':'')));"
        "sel.appendChild(lbl);});"
        "const cg=document.getElementById('chasingGroups');cg.innerHTML='';"
        "if(d.chasingGroups&&d.chasingGroups.length>0){"
        "d.chasingGroups.forEach(g=>{"
        "const div=document.createElement('div');div.className='chasing-group';"
        "div.innerHTML=`<h3 id='gname_${g.groupId}' onclick='editGName(${g.groupId},\"${g.name}\")'>${g.name}</h3>"
        "<div class='group-info'>GPIOs: ${g.outputs.join(', ')} | ${g.interval}ms</div>`;"
        "const btn=document.createElement('button');btn.className='delete';btn.textContent='Delete';btn.onclick=()=>deleteGroup(g.groupId);div.appendChild(btn);"
        "cg.appendChild(div);});}else{cg.innerHTML='<p class=info>No active groups</p>';}"
        "const o=document.getElementById('outputs');o.innerHTML='';"
        "d.outputs.forEach((out,i)=>{"
        "const div=document.createElement('div');"
        "let cls='output'+(out.active?' on':'')+(out.interval>0?' blinking':'')+(out.chasingGroup>=0?' chasing':'');"
        "div.className=cls;"
        "div.innerHTML=`<div><span class='output-name' onclick='editOName(${out.pin},\"${out.name}\")'>${out.name || 'GPIO '+out.pin}${out.chasingGroup>=0?' [G'+out.chasingGroup+']':''}</span>"
        "<div class='brightness'><input type='range' min='0' max='100' value='${out.brightness}' "
        "oninput='this.nextElementSibling.textContent=this.value+\"%\"' onchange='setBright(${out.pin},this.value)'>"
        "<span>${out.brightness}%</span></div>"
        "<div class='interval'><span>Interval:</span><input type='number' min='0' max='10000' value='${out.interval}' "
        "onchange='setInt(${out.pin},this.value)' ${out.chasingGroup>=0?'disabled':''}><span>ms</span></div></div>"
        "<div class='toggle ${out.active?'on':''}' onclick='tog(${out.pin})'></div>`;"
        "o.appendChild(div);});}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function tog(pin){try{const r=await fetch('/api/status');const d=await r.json();"
        "const out=d.outputs.find(o=>o.pin===pin);await fetch('/api/control',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,active:!out.active,brightness:out.brightness})});load();}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function setBright(pin,val){try{const r=await fetch('/api/status');const d=await r.json();"
        "const out=d.outputs.find(o=>o.pin===pin);await fetch('/api/control',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,active:out.active,brightness:parseInt(val)})});}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function setInt(pin,val){try{await fetch('/api/interval',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,interval:parseInt(val)})});load();}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function deleteGroup(gid){if(!confirm('Delete chasing group '+gid+'?'))return;"
        "try{await fetch('/api/chasing/delete',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({groupId:gid})});load();}catch(e){console.error(e);}}"));
        
        server->sendContent(F("async function editGName(gid,oldName){"
        "const name=prompt('Enter new name for group:',oldName);"
        "if(!name||name===oldName)return;"
        "try{await fetch('/api/chasing/name',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({groupId:gid,name:name})});load();}catch(e){alert('Error: '+e);console.error(e);}}"));
        
        server->sendContent(F("async function editOName(pin,oldName){"
        "const name=prompt('Enter new name for output:',oldName||'GPIO '+pin);"
        "if(!name||name===oldName)return;"
        "try{await fetch('/api/name',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:pin,name:name})});load();}catch(e){alert('Error: '+e);console.error(e);}}"));
        
        server->sendContent(F("async function createGroup(){try{"
        "const gid=parseInt(document.getElementById('newGroupId').value);"
        "const interval=parseInt(document.getElementById('newGroupInterval').value);"
        "const outputs=[];"
        "document.querySelectorAll('#outputSelector input[type=checkbox]:checked').forEach(cb=>outputs.push(parseInt(cb.value)));"
        "if(outputs.length<2){alert('Please select at least 2 outputs');return;}"
        "if(gid<1||gid>255){alert('Group ID must be 1-255');return;}"
        "if(interval<50){alert('Interval must be at least 50ms');return;}"
        "await fetch('/api/chasing/create',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({groupId:gid,interval:interval,outputs:outputs})});"
        "document.getElementById('newGroupId').value=parseInt(gid)+1;load();}catch(e){alert('Error: '+e);console.error(e);}}"));;
        
        server->sendContent(F("async function allOn(){try{const r=await fetch('/api/status');const d=await r.json();"
        "for(const o of d.outputs){await fetch('/api/control',{method:'POST',headers:{'Content-Type':'application/json'},"
        "body:JSON.stringify({pin:o.pin,active:true,brightness:100})});}load();}catch(e){console.error(e);}}"));
        
